// src/assets/icons/Logo.js

import Svg, { G, Path } from 'react-native-svg';

const Logo = ({ width = 97.4, height = 50, primaryColor = '#463960', accentColor = '#BF40BF' }) => {
  return (
    <Svg width={width} height={height} viewBox='0 0 97.4 50'>
      <G transform='translate(-60.1 -125)'>
        {/* Буква I (первая) - основной цвет */}
        <Path d='m81.4 127v3.47h7.12v-3.47zm0 5.11v17.3h7.12v-17.3z' fill={primaryColor} />

        {/* Буква G - акцентный цвет */}
        <Path
          d='m93.9 133s-3.12 2.72-3.12 8.67c0 5.65 3.12 8.67 3.12 8.67h7.54v6.26h-2.64v5.66h2.64v13.2h6.96v-13.2h2.55v-5.66h-2.55v-23.6h-6.96zm7.54 1.42v14.4s-3.54-2.01-3.54-7.19c0-5.21 3.54-7.24 3.54-7.24z'
          fill={accentColor}
        />

        {/* Буква D (первая) - основной цвет */}
        <Path
          d='m60.1 126v24h15.3c2.35-3.9 3.52-7.1 3.53-11.8 0.0065-4.94-1.18-8.05-3.53-12.2h-8.15zm7.12 1.65c0.0487 0.0211 4.65 2.04 4.65 10.1 0 8.14-4.63 10.8-4.65 10.8z'
          fill={primaryColor}
        />

        {/* Буква D (вторая) - основной цвет */}
        <Path
          d='m60.1 151v24h15.3c2.35-3.9 3.52-7.1 3.53-11.8 0.0065-4.94-1.18-8.05-3.53-12.2h-8.15zm7.12 1.65c0.0487 0.0211 4.65 2.04 4.65 10.1 0 8.14-4.63 10.8-4.65 10.8z'
          fill={primaryColor}
        />

        {/* Буква I (вторая) - основной цвет */}
        <Path d='m111 127v3.47h7.12v-3.47zm0 5.11v17.3h7.12v-17.3z' fill={primaryColor} />

        {/* Буква L - основной цвет */}
        <Path d='m151 125h6.96v24.9h-6.96z' fill={primaryColor} />

        {/* Буква T - основной цвет */}
        <Path d='m122 128v4.33h-2.64v5.2h2.64v12.1h6.96v-12.1h2.55v-5.2h-2.55v-4.33z' fill={primaryColor} />

        {/* Буква X - основной цвет */}
        <Path
          d='m132 158 5.71 9.31h-3.4l-2.84 8.02h6.83l1.58-4.47 2.74 4.47h7.16l-5.89-9.62h3.18l2.35-7.71h-6.83l-1.13 3.73-2.28-3.73z'
          fill={primaryColor}
        />

        {/* Буква O - основной цвет */}
        <Path
          d='m115 158s-2.14 2.84-2.14 8.67c0 4.95 2.14 8.67 2.14 8.67h13.9s2.14-3.71 2.14-8.67c0-5.83-2.14-8.67-2.14-8.67h-6.96zm6.96 1.47s1.98 2.51 1.98 7.19c0 4.41-1.98 7.19-1.98 7.19-1.2e-4 -1.7e-4 -1.98-2.78-1.98-7.19 0-4.68 1.98-7.19 1.98-7.19z'
          fill={primaryColor}
        />

        {/* Буква E - основной цвет */}
        <Path
          d='m80.4 158v17.3h14s0.309-0.536 0.693-1.47h-7.65v-3.68h7.7s2.39-1.82 2.39-5.94c0-4.58-2.39-6.24-2.39-6.24h-7.7zm7.04 1.43c0.0043 2e-3 3.05 1.19 3.05 4.64 0 3.96-3.05 4.77-3.05 4.77z'
          fill={primaryColor}
        />

        {/* Буква T (в DETOX) - основной цвет */}
        <Path
          d='m148 150v-17.3h-14s-0.309 0.536-0.693 1.47h7.65v3.68h-7.7s-2.39 1.82-2.39 5.94c0 4.58 2.39 6.24 2.39 6.24h7.7zm-7.04-1.43c-4e-3 -2e-3 -3.05-1.19-3.05-4.64 0-3.96 3.05-4.77 3.05-4.77z'
          fill={primaryColor}
        />
      </G>
    </Svg>
  );
};

export default Logo;
